#include <bits/stdc++.h>
using namespace std;
/*
ios::sync_with_stdio(false);
cin.tie(nullptr);
*/

/*
P1002过河卒 ^^
P1010幂次方 ^^
P1024一元三次方程求解 **多解
P1025数的划分 ^^
P1036选数 ^^
P1037产生数
P1048 采药 ^^
P1060 开心的金明 ^^
P1080国王游戏
P1090合并果子 ^^
P1115 最大子段和 ^^
P1147 连续自然数和 ^^
P1199三国游戏 ^^
P1216数字三角形 ^^
P1233 木棍加工
P1309瑞士轮
P1331海战 ^^
P1375 小猫 ^^
P1434滑雪
P1506 拯救oibh总部 ^^
P1535 Cow TravellingS游荡的奶牛
P1540 机器翻译 ^^
P1571眼红的Medusa ^^
p1605迷宫 ^^
P1855 榨取kkksc03 ^^
P2097 资料分发1 ^^
P2671 求和
P3902 递增 ^^
p4552 IncDec Sequence ^^
P4994终于结束的起点 ^^
P5194 Scales S
P5587打字练习
P5657 格雷码 ^^
P6566 观星 ^^
B3622枚举子集 ^^
B4006  宝箱
U637618 [G]琪露诺的完美算数教室 ^^
*/